espressif/esp-matter/examples/light_switch/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# ESP32-C6-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
